In [23]:
from pyspark.sql import SparkSession

In [24]:
import pandas as pd

In [25]:
#reading in pandas
df = pd.read_csv('basic_data.csv')

In [26]:
df

     Name  Age  Experience
0   Bipin   19           1
1  Bardan   21           2
2   Rosan   18           1

In [27]:
#creating a sparksession
spark = SparkSession.builder.appName('Practice').getOrCreate()

In [28]:
spark

In [29]:
#reading csv through pyspark
df_spark = spark.read.option('header','true').csv('basic_data.csv')

In [30]:
df_spark.show()

+------+---+----------+
|  Name|Age|Experience|
+------+---+----------+
| Bipin| 19|         1|
|Bardan| 21|         2|
| Rosan| 18|         1|
+------+---+----------+

In [31]:
type(df_spark)

pyspark.sql.dataframe.DataFrame

In [32]:
df_spark.head(3)

[Row(Name='Bipin', Age='19', Experience='1'),
 Row(Name='Bardan', Age='21', Experience='2'),
 Row(Name='Rosan', Age='18', Experience='1')]

In [33]:
#info of the columns
df_spark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: string (nullable = true)
 |-- Experience: string (nullable = true)

In [34]:
df_spark = spark.read.csv('basic_data.csv',header=True,inferSchema=True)

In [35]:
df_spark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)

In [36]:
df_spark.columns

['Name', 'Age', 'Experience']

In [37]:
df_spark.select('Name')

DataFrame[Name: string]

In [38]:
df_spark.select('Name').show()

+------+
|  Name|
+------+
| Bipin|
|Bardan|
| Rosan|
+------+

In [39]:
df_spark.select(['Name','Age']).show()

+------+---+
|  Name|Age|
+------+---+
| Bipin| 19|
|Bardan| 21|
| Rosan| 18|
+------+---+

In [40]:
df_spark['Name']

Column<'Name'>

In [41]:
df_spark.dtypes

[('Name', 'string'), ('Age', 'int'), ('Experience', 'int')]

In [44]:
#works just like describe of pandas
df_spark.describe().show()

+-------+------+------------------+------------------+
|summary|  Name|               Age|        Experience|
+-------+------+------------------+------------------+
|  count|     3|                 3|                 3|
|   mean|  NULL|19.333333333333332|1.3333333333333333|
| stddev|  NULL|1.5275252316519468|0.5773502691896258|
|    min|Bardan|                18|                 1|
|    max| Rosan|                21|                 2|
+-------+------+------------------+------------------+

In [60]:
df_spark = df_spark.withColumn('Experience after 5 years',df_spark['Experience']+5)

In [61]:
df_spark.show()

+------+---+----------+------------------------+
|  Name|Age|Experience|Experience after 5 years|
+------+---+----------+------------------------+
| Bipin| 19|         1|                       6|
|Bardan| 21|         2|                       7|
| Rosan| 18|         1|                       6|
+------+---+----------+------------------------+

In [63]:
df_spark.drop('Experience after 5 years').show()

+------+---+----------+
|  Name|Age|Experience|
+------+---+----------+
| Bipin| 19|         1|
|Bardan| 21|         2|
| Rosan| 18|         1|
+------+---+----------+

In [65]:
df_spark = df_spark.drop('Experience after 5 years')

In [66]:
df_spark.show()

+------+---+----------+
|  Name|Age|Experience|
+------+---+----------+
| Bipin| 19|         1|
|Bardan| 21|         2|
| Rosan| 18|         1|
+------+---+----------+

In [74]:
#renaming columns
df_spark.withColumnRenamed('Name','New_Name').show()

+--------+---+----------+
|New_Name|Age|Experience|
+--------+---+----------+
|   Bipin| 19|         1|
|  Bardan| 21|         2|
|   Rosan| 18|         1|
+--------+---+----------+

In [89]:
df_two = spark.read.csv('test2.csv',header=True,inferSchema=True)

In [91]:
df_two.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [97]:
df_two.na.drop(how='any',thresh = 3).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
+---------+---+----------+------+

In [98]:
df_two.na.drop(how='any',subset='Experience').show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
+---------+---+----------+------+

In [105]:
df_two.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [118]:
df_two.na.fill('Missing Values').show()

+--------------+----+----------+------+
|          Name| age|Experience|Salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|     Sudhanshu|  30|         8| 25000|
|         Sunny|  29|         4| 20000|
|          Paul|  24|         3| 20000|
|        Harsha|  21|         1| 15000|
|       Shubham|  23|         2| 18000|
|        Mahesh|NULL|      NULL| 40000|
|Missing Values|  34|        10| 38000|
|Missing Values|  36|      NULL|  NULL|
+--------------+----+----------+------+

### The na.fill('Missing values') was not working for the integer columns like Age/Experience/Salary
Only if we read the dataset as 'inferSchema=False' and all the columns are taken in string format by default we can fill the missing values with a string like 'Missing Values'......same goes for the string columns if we fill the missing values with a '0'

### WHY?
na.fill("Missing Values") only works on columns with string data types.
age, Experience, and Salary are numeric columns, so "Missing Values" cannot replace NULLs in those columns (PySpark does not allow mixing data types).

In [119]:
df_two.na.fill('Missing Values').na.fill(0).show()

+--------------+---+----------+------+
|          Name|age|Experience|Salary|
+--------------+---+----------+------+
|         Krish| 31|        10| 30000|
|     Sudhanshu| 30|         8| 25000|
|         Sunny| 29|         4| 20000|
|          Paul| 24|         3| 20000|
|        Harsha| 21|         1| 15000|
|       Shubham| 23|         2| 18000|
|        Mahesh|  0|         0| 40000|
|Missing Values| 34|        10| 38000|
|Missing Values| 36|         0|     0|
+--------------+---+----------+------+

In [123]:
#replacing null values with mean values using imputer class of pyspark(not sklearn)
from pyspark.ml.feature import Imputer
imputer = Imputer(
    inputCols=["age", "Experience", "Salary"], 
    outputCols=["age_imputed", "Experience_imputed", "Salary_imputed"]
).setStrategy("mean")
imputer.fit(df_two).transform(df_two).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Paul|  24|         3| 20000|         24|                 3|         20000|
|   Harsha|  21|         1| 15000|         21|                 1|         15000|
|  Shubham|  23|         2| 18000|         23|                 2|         18000|
|   Mahesh|NULL|      NULL| 40000|         28|                 5|         40000|
|     NULL|  34|        10| 38000|         34|                10|         38000|
|     NULL|  36|      NULL|  NULL|         36|                 5|         25750|
+---------+----+----------+------+-----------+------------------+--------------+